app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "authors".* FROM "authors" ORDER BY "authors"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def show
    # binding.pry
    @post = Post.find(params[:id])
    @post.author_id = Author.last.id